abstractsig/io/cpu/cortex-m/stm32f4xx/io_cpu.h
#ifndef timer3_io_cpu_interrupt
# define timer3_io_cpu_interrupt	unhandled_cpu_interrupt
#endif

//
// implementation
//
#ifdef IMPLEMENT_STM32F4_IO_CPU
//
// pins
//

static void
enable_gpio_port_a_clock (void) {
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
}

static void
enable_gpio_port_b_clock (void) {
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
}

static void
enable_gpio_port_c_clock (void) {
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
}

static void
enable_gpio_port_d_clock (void) {
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
}

const struct stm_gpio_port stm_gpio_ports[] = {
	{GPIOA,enable_gpio_port_a_clock},
	{GPIOB,enable_gpio_port_b_clock},
	{GPIOC,enable_gpio_port_c_clock},
	{GPIOD,enable_gpio_port_d_clock},
	{NULL}
};

void
configure_stm32f4_io_pin_alternate (stm32f4_io_pin_t pin) {
	GPIO_InitTypeDef GPIO_InitStructure;

	stm_gpio_pin_enable_port_clock(pin);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = stm_gpio_pin_output_type(pin);
	GPIO_InitStructure.GPIO_PuPd = stm_gpio_pin_pull (pin);
	GPIO_InitStructure.GPIO_Speed = stm_gpio_pin_speed (pin);
	GPIO_InitStructure.GPIO_Pin = (1 << stm_gpio_pin_number (pin));
	GPIO_Init(stm_gpio_pin_port (pin), &GPIO_InitStructure);

	GPIO_PinAFConfig (
		stm_gpio_pin_port (pin),
		stm_gpio_pin_number (pin),
		stm_gpio_pin_alternate(pin)
	);
}

void
configure_stm32f4_io_pin (stm32f4_io_pin_t pin) {
	GPIO_InitTypeDef GPIO_InitStructure;

	stm_gpio_pin_enable_port_clock(pin);

	GPIO_InitStructure.GPIO_Mode = stm_gpio_pin_function(pin);
	GPIO_InitStructure.GPIO_Pin = (1 << stm_gpio_pin_number (pin));
	GPIO_InitStructure.GPIO_OType = stm_gpio_pin_output_type(pin);
	GPIO_InitStructure.GPIO_Speed = stm_gpio_pin_speed (pin);
	GPIO_Init(stm_gpio_pin_port (pin), &GPIO_InitStructure);
}


//
// clocks
//
static float64_t
stm32f4_hsi_oscillator_get_frequency (io_cpu_clock_pointer_t this) {
	stm32f4_rc_oscillator_t const *c = (stm32f4_rc_oscillator_t const*) (
		io_cpu_clock_ro_pointer (this)
	);
	return c->frequency;
}

static bool
stm32f4_hsi_oscillator_start (io_cpu_clock_pointer_t this) {
	if (RCC_GetFlagStatus(RCC_FLAG_HSIRDY) == 0) {
		// HSION
		RCC->CR |= (uint32_t)0x00000001;
		while (RCC_GetFlagStatus(RCC_FLAG_HSIRDY) == 0);
		return true;
	} else {
		return true;
	}
}

EVENT_DATA io_cpu_clock_implementation_t stm32f4_hsi_oscillator_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_frequency = stm32f4_hsi_oscillator_get_frequency,
	.link_input_to_output = NULL,
	.link_output_to_input = NULL,
	.start = stm32f4_hsi_oscillator_start,
	.stop = NULL,
};

bool
stm32f4_clock_is_hsi (io_cpu_clock_pointer_t clock) {
	return io_cpu_clock_has_implementation (clock,&stm32f4_hsi_oscillator_implementation);
}

static float64_t
stm32f4_hse_oscillator_get_frequency (io_cpu_clock_pointer_t this) {
	stm32f4_crystal_oscillator_t const *c = (stm32f4_crystal_oscillator_t const*) (
		io_cpu_clock_ro_pointer (this)
	);
	return c->crystal_frequency;
}

static bool
stm32f4_hse_oscillator_start (io_cpu_clock_pointer_t this) {
	if (RCC_GetFlagStatus(RCC_FLAG_HSERDY) == 0) {
		RCC_HSEConfig(RCC_HSE_ON);
		if (RCC_WaitForHSEStartUp () == SUCCESS) {
			return true;
		} else {
			return false;
		}
	} else {
		return true;
	}
}

EVENT_DATA io_cpu_clock_implementation_t stm32f4_hse_oscillator_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_frequency = stm32f4_hse_oscillator_get_frequency,
	.link_input_to_output = NULL,
	.link_output_to_input = NULL,
	.start = stm32f4_hse_oscillator_start,
	.stop = NULL,
};

bool
stm32f4_clock_is_hse (io_cpu_clock_pointer_t clock) {
	return io_cpu_clock_has_implementation (clock,&stm32f4_hse_oscillator_implementation);
}

static float64_t
stm32f4_pll_oscillator_get_frequency (io_cpu_clock_pointer_t clock) {
	stm32f4_pll_t const *this = (
		(stm32f4_pll_t const*) io_cpu_clock_ro_pointer (clock)
	);
	float64_t f = io_cpu_clock_get_frequency (this->input);

	f = ((f / (float64_t) this->M) * (float64_t) this->N) / (float64_t) (this->P);

	return f;
}

static bool
stm32f4_pll_oscillator_start (io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (clock)) {
		stm32f4_pll_t const *this = (
			(stm32f4_pll_t const*) io_cpu_clock_ro_pointer (clock)
		);
		uint32_t source = 0;

		if (stm32f4_clock_is_hse (this->input)) {
			source = RCC_PLLCFGR_PLLSRC_HSE;
		} else if (stm32f4_clock_is_hsi (this->input)) {
			source = RCC_PLLCFGR_PLLSRC_HSI;
		} else {
			return false;
		}

		RCC->PLLCFGR = (
				this->M
			|	(this->N << 6)
			|	(((this->P >> 1) -1) << 16)
			| 	(source)
			|	(this->Q << 24)
		);
		RCC->CR |= RCC_CR_PLLON;

		while((RCC->CR & RCC_CR_PLLRDY) == 0);

		return true;
	} else {
		return false;
	}
}

EVENT_DATA io_cpu_clock_implementation_t stm32f4_pll_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_frequency = stm32f4_pll_oscillator_get_frequency,
	.link_input_to_output = NULL,
	.link_output_to_input = NULL,
	.start = stm32f4_pll_oscillator_start,
	.stop = NULL,
};

static float64_t
stm32f4_apb_clock_get_frequency (io_cpu_clock_pointer_t clock) {
	stm32f4_apb_clock_t const *this = (
		(stm32f4_apb_clock_t const*) io_cpu_clock_ro_pointer (clock)
	);
	float64_t f = io_cpu_clock_get_frequency (this->input);
	return f / (float64_t) this->divider;
}

EVENT_DATA io_cpu_clock_implementation_t stm32f4_apb_clock_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_frequency = stm32f4_apb_clock_get_frequency,
	.link_input_to_output = NULL,
	.link_output_to_input = NULL,
	.start = NULL,
	.stop = NULL,
};

void
stm32f4_enable_spi1_apb_clock (void) {
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);
}

void
stm32f4_enable_uart1_apb_clock (void) {
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
}

static bool
stm32f4_ahb_clock_start (io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (clock)) {
		stm32f4_ahb_clock_t const *this = (
			(stm32f4_ahb_clock_t const*) io_cpu_clock_ro_pointer (clock)
		);
		bool ok = true;

		switch (this->divider) {
			case 1:
				RCC->CFGR |= RCC_CFGR_HPRE_DIV1;
			break;

			default:
				ok = false;
			break;
		}

		return ok;
	} else {
		return false;
	}
}

