abstractsig/io/cpu/cortex-m/stm32f4xx/io_cpu.h
			NVIC_SetPriority (this->interrupt_number,0);
			NVIC_EnableIRQ (this->interrupt_number);
		}
	}

	return true;
}

static void
stm32f4_uart_close (io_socket_t *socket) {
	// and then ....
}

static io_t*
stm32f4_uart_get_io (io_socket_t *socket) {
	stm32f4_uart_t *this = (stm32f4_uart_t*) socket;
	return this->io;
}

static io_encoding_t*
stm32f4_uart_new_message (io_socket_t *socket) {
	stm32f4_uart_t *this = (stm32f4_uart_t*) socket;
	return new_io_encoding (this->encoding,io_get_byte_memory(this->io));
}

static bool
stm32f4_uart_send_message_blocking (io_socket_t *socket,io_encoding_t *encoding) {
	if (is_io_binary_encoding (encoding)) {
		stm32f4_uart_t *this = (stm32f4_uart_t*) socket;
		const uint8_t *b,*e;

		io_encoding_get_ro_bytes (encoding,&b,&e);
		while (b < e) {
			while (!(this->uart_registers->SR & USART_SR_TXE));
			this->uart_registers->DR = *b++;
		}
		
		io_encoding_free(encoding);

		return true;
	} else {
		return false;
	}
}

static size_t
stm32f4_uart_mtu (io_socket_t const *socket) {
	return 1024;	//???
}

#define io_event_is_valid(ev) 	((ev)->handler != NULL)
#define io_event_is_active(ev) 	((ev)->next_event != NULL)

bool
stm32f4_uart_binds (io_socket_t *socket,io_event_t *rx) {
	stm32f4_uart_t *this = (stm32f4_uart_t*) socket;
	if (this->rx_pipe->ev.next_event == NULL) {
		this->rx_pipe->ev = *rx;
		return true;
	} else {
		return false;
	}
}

static io_pipe_t*
stm32f4_uart_get_inward_pipe (io_socket_t *socket) {
	stm32f4_uart_t *this = (stm32f4_uart_t*) socket;
	return (io_pipe_t*) this->rx_pipe;
}

EVENT_DATA io_socket_implementation_t stm32f4_uart_implementation = {
	.specialisation_of = NULL,
	.initialise = stm32f4_uart_initialise,
	.free = NULL,
	.get_io = stm32f4_uart_get_io,
	.open = stm32f4_uart_open,
	.close = stm32f4_uart_close,
	.binds = stm32f4_uart_binds,
	.get_inward_pipe = stm32f4_uart_get_inward_pipe,
	.new_message = stm32f4_uart_new_message,
	.send_message = stm32f4_uart_send_message_blocking,
	.iterate_inner_sockets = NULL,
	.iterate_outer_sockets = NULL,
	.mtu = stm32f4_uart_mtu,
};

//
// STM32 ADC
//
static int
stm32f4_analog_read (ADC_TypeDef *ADCx,uint32_t channel_number, bool fastConversion) {
	static bool is_initialised = false;
	bool needs_init = false;

	if (!fastConversion) {
		if (ADCx == ADC1) {
	      if (!is_initialised) {
	        is_initialised = true;
	        needs_init = true;
	        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
	      }
		}
	}
	if (needs_init) {
		ADC_CommonInitTypeDef ADC_CommonInitStructure;
		ADC_InitTypeDef ADC_InitStructure;

		ADC_CommonStructInit(&ADC_CommonInitStructure);
		ADC_CommonInit(&ADC_CommonInitStructure);

		ADC_StructInit(&ADC_InitStructure);
		// Preinit
		ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
		ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Left;
		ADC_InitStructure.ADC_ScanConvMode = DISABLE;
		ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
		ADC_Init(ADCx, &ADC_InitStructure);

		// Enable the ADC
		ADC_Cmd(ADCx, ENABLE);
	}

	uint8_t sampleTime = fastConversion ? ADC_SampleTime_3Cycles : ADC_SampleTime_480Cycles;
	ADC_RegularChannelConfig(ADCx,channel_number, 1, sampleTime);
	ADC_SoftwareStartConv(ADCx);

	while (ADC_GetFlagStatus(ADCx, ADC_FLAG_EOC) == RESET);

	return (int)ADC_GetConversionValue(ADCx);
}

//
// to generate, repeatedly read the voltage reference and XOR
// it into a rotated number to get a random-ish result
//
static uint32_t
stm32f4_random_uint32 (io_t *io) {
	ADC_TempSensorVrefintCmd(ENABLE);
	// don't wait here. We want to be reading as the voltage reference
	// tries to start up, so make things as random as we can!
	int s;
	uint32_t v = 0;
	for (s = 0; s < 32; s++) {
		v = (v<<3) ^ (v>>29) ^ (unsigned int)stm32f4_analog_read(ADC1,ANALOG_CHANNEL_17, false);
	}
	ADC_TempSensorVrefintCmd(DISABLE);
	return v;
}

static void
stm32f4_log (io_t *io,char const *fmt,va_list va) {

}

static io_byte_memory_t*
stm32f4_io_get_byte_memory (io_t *io) {
	stm32f4xx_io_t *this = (stm32f4xx_io_t*) io;
	return this->bm;
}

static io_value_memory_t*
stm32f4_io_get_stm (io_t *io) {
	stm32f4xx_io_t *this = (stm32f4xx_io_t*) io;
	return this->vm;
}

static void
stm32f4_panic (io_t *io,int code) {
	DISABLE_INTERRUPTS;
	while (1);
}

static void
stm32f4_wait_for_event (io_t *io) {
	__WFI();
}

static void
wait_for_all_events (io_t *io) {
	io_event_t *event;
	io_alarm_t *alarm;
	do {
		ENTER_CRITICAL_SECTION(io);
		event = io->events;
		alarm = io->alarms;
		EXIT_CRITICAL_SECTION(io);
	} while (
			event != &s_null_io_event
		&&	alarm != &s_null_io_alarm
	);
}

static bool
stm32f4_is_in_event_thread (io_t *io) {
	return ((stm32f4xx_io_t*) io)->in_event_thread;
}

static bool
stm32f4_enter_critical_section (io_t *env) {
	uint32_t interrupts_are_enabled = !(__get_PRIMASK() & 0x1);
	DISABLE_INTERRUPTS;
	return interrupts_are_enabled;
}

static void
stm32f4_exit_critical_section (io_t *io,bool were_enabled) {
	if (were_enabled) {
		ENABLE_INTERRUPTS;
	}
}

static void
signal_event_pending (io_t *io) {
	SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
}

static void
stm32f4_do_gc (io_t *io,int32_t count) {
	io_value_memory_do_gc (io_get_stm (io),count);
}

io_cpu_clock_pointer_t
stm32f4_get_core_clock (io_t *io) {
	extern EVENT_DATA stm32f4_core_clock_t cpu_core_clock;
	return IO_CPU_CLOCK(&cpu_core_clock);
}

static io_socket_t*
io_device_get_null_socket (io_t *io,int32_t h) {
	return NULL;
}

void
initialise_core_clock (io_t *io) {
	io_cpu_clock_pointer_t core_clock = io_get_core_clock(io);
	uint32_t cf = io_cpu_clock_get_frequency (core_clock);

	io_cpu_clock_start (core_clock);

	//
	// requires core clock frequency to be a multiple of 1MHz
	//
	SysTick->LOAD = cf/1000000UL;
	SysTick->LOAD -= 1UL;
	SysTick->VAL = 0UL;
	SysTick->CTRL = (
			SysTick_CTRL_CLKSOURCE_Msk
		|	SysTick_CTRL_ENABLE_Msk
	);
}


static void
tune_stm32f4_cpu (void) {
	#if (__FPU_PRESENT == 1) && (__FPU_USED == 1)
	// set CP10 and CP11 to full access
	SCB->CPACR |= ((3UL << 10*2)|(3UL << 11*2));
	#endif

	/* Set HSION bit */
	RCC->CR |= (uint32_t)0x00000001;

