abstractsig/io/cpu/cortex-m/stm32f4xx/io_cpu.h
	/* Reset CFGR register */
	RCC->CFGR = 0x00000000;

	/* Reset HSEON, CSSON and PLLON bits */
	RCC->CR &= (uint32_t)0xFEF6FFFF;

	/* Reset PLLCFGR register */
	RCC->PLLCFGR = 0x24003010;

	/* Reset HSEBYP bit */
	RCC->CR &= (uint32_t)0xFFFBFFFF;

	// Disable all interrupts
	RCC->CIR = 0x00000000;

	// enable instruction and data cache
	FLASH->ACR = (
			FLASH_ACR_ICEN
		|	FLASH_ACR_DCEN
	);

    // regulator voltage output Scale 1 for core clock up to 168 MHz
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    PWR->CR |= PWR_CR_VOS;

}

static io_interrupt_handler_t cpu_interrupts[NUMBER_OF_INTERRUPT_VECTORS];
__attribute__ ((section(".ram_vector_table")))
uint32_t interrupt_vector_table[NUMBER_OF_INTERRUPT_VECTORS];

static void
null_interrupt_handler (void *w) {
	while(1);
}

static void	
register_interrupt_handler (
	io_t *io,int32_t number,io_interrupt_action_t handler,void *user_value
) {
	io_interrupt_handler_t *i = (
		cpu_interrupts + number + NUMBER_OF_ARM_INTERRUPT_VECTORS
	);
	i->action = handler;
	i->user_value = user_value;

	//
	// arm vextors are carried over for the original flash table
	//
	if (number < 0) {
		interrupt_vector_table[number + NUMBER_OF_ARM_INTERRUPT_VECTORS] = (
			(uint32_t) handle_io_cpu_interrupt
		);
	}
}
static io_byte_memory_t heap_byte_memory;
static io_byte_memory_t umm_value_memory;
static umm_io_value_memory_t stm;

static io_implementation_t io_i = {
	.get_byte_memory = stm32f4_io_get_byte_memory,
	.get_stm = stm32f4_io_get_stm,
	.do_gc = stm32f4_do_gc,
	.get_core_clock = stm32f4_get_core_clock,
	.get_random_u32 = stm32f4_random_uint32,
	.log = stm32f4_log,
	.panic = stm32f4_panic,
	.wait_for_event = stm32f4_wait_for_event,
	.wait_for_all_events = wait_for_all_events,
	.in_event_thread = stm32f4_is_in_event_thread,
	.enter_critical_section = stm32f4_enter_critical_section,
	.exit_critical_section = stm32f4_exit_critical_section,
	.register_interrupt_handler = register_interrupt_handler,
	.unregister_interrupt_handler = NULL,
	.signal_event_pending = signal_event_pending,
	.enqueue_event = enqueue_io_event,
	.dequeue_event = dequeue_io_event,
	.next_event = do_next_io_event,
	.get_socket = io_device_get_null_socket,
};

/*
 *-----------------------------------------------------------------------------
 *
 * get the io resources for the stm32f4
 *
 *-----------------------------------------------------------------------------
 */
io_t*
initialise_cpu_io (stm32f4xx_io_t *cpu) {
	io_t *io = (io_t*) cpu;

	// tune cpu ...
	NVIC_SetPriorityGrouping(0);
	SCB->VTOR = FLASH_BASE;

	io_device_add_io_methods (&io_i);
	
	cpu->implementation = &io_i;
	cpu->bm = &heap_byte_memory;
	cpu->vm = (io_value_memory_t*) &stm;
	cpu->in_event_thread = 0;

	initialise_io (io,&io_i);

	initialise_core_clock (io);

	stm.io = io;
	initialise_io_byte_memory (io,&heap_byte_memory);
	initialise_io_byte_memory (io,&umm_value_memory);

	return io;
}

static void
make_ram_interrupt_vectors (void) {
	extern const void* s_flash_vector_table[NUMBER_OF_ARM_INTERRUPT_VECTORS];

	uint32_t *dest = interrupt_vector_table;
	uint32_t *end = dest + NUMBER_OF_ARM_INTERRUPT_VECTORS;
	uint32_t *src = (uint32_t*) s_flash_vector_table;
	
	while (dest < end) *dest++ = *src++;

	// fill remaining vectors with default handler
	end += NUMBER_OF_STM32F4_INTERRUPT_VECTORS;
	while (dest < end) *dest++ = (uint32_t) handle_io_cpu_interrupt;

	{
		io_interrupt_handler_t *i = cpu_interrupts;
		io_interrupt_handler_t *e = i + NUMBER_OF_INTERRUPT_VECTORS;
		while (i < e) {
			i->action = null_interrupt_handler;
			i->user_value = NULL;
			i++;
		}
	}

	#ifdef NO_EV
	SCB->VTOR = (unsigned int) interrupt_vector_table;
	#endif
}

static void
initialise_c_runtime (void) {
	extern uint32_t ld_start_of_sdata_in_flash,ld_start_of_sdata_in_ram,ld_end_of_sdata_in_ram;
	extern uint32_t ld_start_of_bss,ld_end_of_bss;

	uint32_t *src = &ld_start_of_sdata_in_flash;
	uint32_t *dest = &ld_start_of_sdata_in_ram;

	while(dest < &ld_end_of_sdata_in_ram) *dest++ = *src++;
	dest = &ld_start_of_bss;
	while(dest < &ld_end_of_bss) *dest++ = 0;

	// fill stack/heap region of RAM with a pattern
	extern uint32_t ld_end_of_static_ram_allocations;
	uint32_t *end = (uint32_t*) __get_MSP();
	dest = &ld_end_of_static_ram_allocations;
	while (dest < end) {
		*dest++ = 0xdeadc0de;
	}
	
	make_ram_interrupt_vectors ();
}

//
// entry point on core reset (CPU starts on HSI @ 16MHz)
//
int main(void);
void
stm32f4_core_reset (void) {
	initialise_c_runtime();
	tune_stm32f4_cpu ();
	main ();
	while (1);
}

void
unhandled_cpu_interrupt (void *user_value) {
	while (1);
}

extern uint32_t ld_top_of_c_stack;
__attribute__ ((section(".isr_vector")))
const void* s_flash_vector_table[/* 16 + 89 */] = {
	&ld_top_of_c_stack,
	stm32f4_core_reset,	//
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,
	handle_io_cpu_interrupt,

	handle_io_cpu_interrupt,				// Window Watchdog interrupt
	handle_io_cpu_interrupt,				// PVD through EXTI line detection interrupt
	handle_io_cpu_interrupt,				// Tamper and TimeStamp interrupts through the EXTI line
	handle_io_cpu_interrupt,				// RTC Wakeup interrupt through the EXTI line
	handle_io_cpu_interrupt,				// Reserved
	handle_io_cpu_interrupt,				// RCC global interrupt
	handle_io_cpu_interrupt,				// EXTI Line0 interrupt
	handle_io_cpu_interrupt,				// EXTI Line1 interrupt
	handle_io_cpu_interrupt,				// EXTI Line2 interrupt
	handle_io_cpu_interrupt,				// EXTI Line3 interrupt
	handle_io_cpu_interrupt,				// EXTI Line4 interrupt
	handle_io_cpu_interrupt,				// DMA1 Stream0 global interrupt
	handle_io_cpu_interrupt,				// DMA1 Stream1 global interrupt
	handle_io_cpu_interrupt,				// DMA1 Stream2 global interrupt
	handle_io_cpu_interrupt,				// DMA1 Stream3 global interrupt
	handle_io_cpu_interrupt,				// DMA1 Stream4 global interrupt
	handle_io_cpu_interrupt,				// DMA1 Stream5 global interrupt
	handle_io_cpu_interrupt,				// DMA1 Stream6 global interrupt
	handle_io_cpu_interrupt,				// ADC3 global interrupts
	handle_io_cpu_interrupt,				// CAN1 TX interrupts
	handle_io_cpu_interrupt,				// CAN1 RX0 interrupts
	handle_io_cpu_interrupt,				// CAN1 RX1 interrupts
	handle_io_cpu_interrupt,				// CAN1 SCE interrupt
	handle_io_cpu_interrupt,				// EXTI Line[9:5] interrupts
	handle_io_cpu_interrupt,				// TIM1 Break interrupt and TIM9 global interrupt
	handle_io_cpu_interrupt,				// TIM1 Update interrupt and TIM10 global interrupt
	handle_io_cpu_interrupt,				// TIM1 Trigger and Commutation interrupts and TIM11 global interrupt
	handle_io_cpu_interrupt,				// TIM1 Capture Compare interrupt
	handle_io_cpu_interrupt,				// TIM2 global interrupt
	handle_io_cpu_interrupt,				// TIM3 global interrupt
	handle_io_cpu_interrupt,				// TIM4 global interrupt
	handle_io_cpu_interrupt,				// I2C1 event interrupt
	handle_io_cpu_interrupt,				// I2C1 error interrupt
	handle_io_cpu_interrupt,				// I2C2 event interrupt
	handle_io_cpu_interrupt,				// I2C2 error interrupt
	handle_io_cpu_interrupt,				// SPI1 global interrupt
	handle_io_cpu_interrupt,				// SPI2 global interrupt
	handle_io_cpu_interrupt,				// USART1 global interrupt
	handle_io_cpu_interrupt,				// USART2 global interrupt
	handle_io_cpu_interrupt,				// USART3 global interrupt
	handle_io_cpu_interrupt,				// EXTI Line[15:10] interrupts
	handle_io_cpu_interrupt,				// RTC Alarms (A and B) through EXTI line interrupt
	handle_io_cpu_interrupt,				// USB On-The-Go FS Wakeup through EXTI line interrupt
	handle_io_cpu_interrupt,				// TIM8 Break interrupt and TIM12 global interrupt
	handle_io_cpu_interrupt,				// TIM8 Update interrupt and TIM13 global interrupt
	handle_io_cpu_interrupt,				// TIM8 Trigger and Commutation interrupts and TIM14 global interrupt
	handle_io_cpu_interrupt,				// TIM8 Capture Compare interrupt
	handle_io_cpu_interrupt,				// DMA1 Stream7 global interrupt
	handle_io_cpu_interrupt,				// FSMC global interrupt
	handle_io_cpu_interrupt,				// SDIO global interrupt
	handle_io_cpu_interrupt,				// TIM5 global interrupt
	handle_io_cpu_interrupt,				// SPI3 global interrupt
	handle_io_cpu_interrupt,				// UART4 global interrupt
	handle_io_cpu_interrupt,				// UART5 global interrupt
	handle_io_cpu_interrupt,				// TIM6 global interrupt, DAC1 and DAC2 underrun error interrupt
	handle_io_cpu_interrupt,				// TIM7 global interrupt
	handle_io_cpu_interrupt,				// DMA2 Stream0 global interrupt
	handle_io_cpu_interrupt,				// DMA2 Stream1 global interrupt
	handle_io_cpu_interrupt,				// DMA2 Stream2 global interrupt
	handle_io_cpu_interrupt,				// DMA2 Stream3 global interrupt
	handle_io_cpu_interrupt,				// DMA2 Stream4 global interrupt
	handle_io_cpu_interrupt,				// Ethernet global interrupt
	handle_io_cpu_interrupt,				// Ethernet Wakeup through EXTI line interrupt
	handle_io_cpu_interrupt,				// CAN2 TX interrupts
	handle_io_cpu_interrupt,				// CAN2 RX0 interrupts
	handle_io_cpu_interrupt,				// CAN2 RX1 interrupts
	handle_io_cpu_interrupt,				// CAN2 SCE interrupt
	handle_io_cpu_interrupt,				// USB On The Go FS global interrupt
	handle_io_cpu_interrupt,				// DMA2 Stream5 global interrupt
	handle_io_cpu_interrupt,				// DMA2 Stream6 global interrupt
	handle_io_cpu_interrupt,				// DMA2 Stream7 global interrupt
	handle_io_cpu_interrupt,				// USART6 global interrupt
	handle_io_cpu_interrupt,				// I2C3 event interrupt
	handle_io_cpu_interrupt,				// I2C3 error interrupt
	handle_io_cpu_interrupt,				// USB On The Go HS End Point 1 Out global interrupt
	handle_io_cpu_interrupt,				// USB On The Go HS End Point 1 In global interrupt
	handle_io_cpu_interrupt,				// USB On The Go HS Wakeup through EXTI interrupt
	handle_io_cpu_interrupt,				// USB On The Go HS global interrupt
	handle_io_cpu_interrupt,				// DCMI global interrupt
	handle_io_cpu_interrupt,				// CRYP crypto global interrupt
	handle_io_cpu_interrupt,				// Hash and Rng global interrupt
	handle_io_cpu_interrupt,				// Floating point interrupt
	handle_io_cpu_interrupt,				// Reserved
	handle_io_cpu_interrupt,				// Reserved
	handle_io_cpu_interrupt,				// Reserved
	handle_io_cpu_interrupt,				// Reserved
	handle_io_cpu_interrupt,				// Reserved
	handle_io_cpu_interrupt,				// Reserved
	handle_io_cpu_interrupt,				// LTDC global interrupt
	handle_io_cpu_interrupt,				// LTDC global error interrupt
};

static uint32_t g_us_delay;

